RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/inc/hc32_ll_clk.h
/**
 *******************************************************************************
 * @file  hc32_ll_clk.h
 * @brief This file contains all the functions prototypes of the CLK driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32_LL_CLK_H__
#define __HC32_LL_CLK_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_def.h"

#include "hc32f4xx.h"
#include "hc32f4xx_conf.h"
/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @addtogroup LL_CLK
 * @{
 */

#if (LL_CLK_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup CLK_Global_Types CLK Global Types
 * @{
 */
/**
 * @brief  CLK XTAL configuration structure definition
 */
typedef struct {
    uint8_t u8State;        /*!< The new state of the XTAL.
                                This parameter can be a value of @ref CLK_XTAL_Config   */

    uint8_t u8Drv;          /*!< The XTAL drive ability.
                                This parameter can be a value of @ref CLK_XTAL_Config   */

    uint8_t u8Mode;         /*!< The XTAL mode selection osc or exclk.
                                This parameter can be a value of @ref CLK_XTAL_Config   */

    uint8_t u8SuperDrv;     /*!< The XTAL super drive on or off.
                                This parameter can be a value of @ref CLK_XTAL_Config   */

    uint8_t u8StableTime;   /*!< The XTAL stable time selection.
                                This parameter can be a value of @ref CLK_XTAL_Config   */
} stc_clock_xtal_init_t;

/**
 * @brief  CLK XTAL fault detect configuration structure definition
 */
typedef struct {
    uint8_t u8State;   /*!< Specifies the new state of XTALSTD.
                                This parameter can be a value of @ref CLK_XTALSTD_Config    */

    uint8_t u8Mode;    /*!< Specifies the XTALSTD mode.
                                This parameter can be a value of @ref CLK_XTALSTD_Config    */

    uint8_t u8Int;     /*!< Specifies the XTALSTD interrupt on or off.
                                This parameter can be a value of @ref CLK_XTALSTD_Config    */

    uint8_t u8Reset;   /*!< Specifies the XTALSTD reset on or off.
                                This parameter can be a value of @ref CLK_XTALSTD_Config    */
} stc_clock_xtalstd_init_t;

/**
 * @brief  CLK XTAL32 configuration structure definition
 */
typedef struct {
    uint8_t u8State;        /*!< Xtal32 new state,
                                @ref CLK_XTAL32_Config for details */

    uint8_t u8Drv;          /*!< Xtal32 drive capacity setting,
                                @ref CLK_XTAL32_Config for details */

    uint8_t u8Filter;       /*!< Xtal32 noise filter setting,
                                @ref CLK_XTAL32_Config for details */
} stc_clock_xtal32_init_t;

/**
 * @brief  CLK clock frequency configuration structure definition
 */
typedef struct {
    union {
        uint32_t SCFGR;     /*!< clock frequency config register  */
        struct {
            uint32_t PCLK0S     : 3;    /*!< PCLK0      */
            uint32_t resvd0     : 1;    /*!< reserved   */
            uint32_t PCLK1S     : 3;    /*!< PCLK1      */
            uint32_t resvd1     : 1;    /*!< reserved   */
            uint32_t PCLK2S     : 3;    /*!< PCLK2      */
            uint32_t resvd2     : 1;    /*!< reserved   */
            uint32_t PCLK3S     : 3;    /*!< PCLK3      */
            uint32_t resvd3     : 1;    /*!< reserved   */
            uint32_t PCLK4S     : 3;    /*!< PCLK4      */
            uint32_t resvd4     : 1;    /*!< reserved   */
            uint32_t EXCKS      : 3;    /*!< EXCLK      */
            uint32_t resvd5     : 1;    /*!< reserved   */
            uint32_t HCLKS      : 3;    /*!< HCLK       */
            uint32_t resvd6     : 5;    /*!< reserved   */
        } SCFGR_f;
    };
} stc_clock_scale_t;

/**
 * @brief  CLK PLL configuration structure definition
 * @note   PLL for MPLL while HC32F460,HC32F451,HC32F452
 *         PLL for PLLH while HC32F4A0
 */
typedef struct {
    uint8_t u8PLLState;         /*!< PLL new state, @ref CLK_PLL_Config for details */
    union {
        uint32_t PLLCFGR;       /*!< PLL config register */
        struct {
            uint32_t PLLM   : 5; /*!< PLL M divide */
            uint32_t resvd0 : 2; /*!< reserved */
            uint32_t PLLSRC : 1; /*!< PLL/PLLA source clock select */
            uint32_t PLLN   : 9; /*!< PLL N multi   */
            uint32_t resvd1 : 3; /*!< reserved      */
            uint32_t PLLR   : 4; /*!< PLL R divide  */
            uint32_t PLLQ   : 4; /*!< PLL Q divide  */
            uint32_t PLLP   : 4; /*!< PLL P divide  */
        } PLLCFGR_f;
    };
} stc_clock_pll_init_t;

/**
 * @brief  CLK PLLx configuration structure definition
 * @note   PLLx for UPLL while HC32F460,HC32F451,HC32F452
 *         PLLx for PLLA while HC32F4A0
 */
typedef struct {
    uint8_t u8PLLState;          /*!< PLLx new state, @ref CLK_PLLx_State for details */
    union {
        uint32_t PLLCFGR;        /*!< PLLx config register */
        struct {
            uint32_t PLLM   : 5; /*!< PLLx M divide */
            uint32_t resvd0 : 3; /*!< reserved */
            uint32_t PLLN   : 9; /*!< PLLx N multi- */
            uint32_t resvd1 : 3; /*!< reserved */
            uint32_t PLLR   : 4; /*!< PLLx R divide */
            uint32_t PLLQ   : 4; /*!< PLLx Q divide */
            uint32_t PLLP   : 4; /*!< PLLx P divide */
        } PLLCFGR_f;
    };
}  stc_clock_pllx_init_t;

/**
 * @brief  CLK bus frequency structure definition
 */
typedef struct {
    uint32_t u32SysclkFreq;        /*!< System clock frequency. */
    uint32_t u32HclkFreq;          /*!< Hclk frequency.         */

